tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/avr"
tap "px4/px4"
# Search tool like grep, but optimized for programmers
brew "ack"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Spell checker with better logic than ispell
brew "aspell"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# IRC to other chat networks gateway
brew "bitlbee", restart_service: true
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Message bus system, providing inter-application communication
brew "dbus"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Source code tag system
brew "global"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Password manager
brew "pass"
# Python dependency management tool
brew "pipenv"
# Draw UML diagrams
brew "plantuml"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Show ps output as a tree
brew "pstree"
# Python bindings for v5 of Qt
brew "pyqt"
# Software environment for statistical computing
brew "r"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Extensible IRC client
brew "weechat", args: ["with-perl", "with-python@2"]
# Internet file retriever
brew "wget"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc"
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi"
cask "aws-vault"
cask "font-iosevka"
cask "qutebrowser"
