tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/avr"
tap "px4/px4"
# Search tool like grep, but optimized for programmers
brew "ag"
# Spell checker with better logic than ispell
brew "aspell"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Message bus system, providing inter-application communication
brew "dbus"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Source code tag system
brew "global"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Draw UML diagrams
brew "plantuml"
# Show ps output as a tree
brew "pstree"
# Python bindings for v5 of Qt
brew "pyqt"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Internet file retriever
brew "wget"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc"
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi"
cask "font-iosevka"
