tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "olafurpg/scalafmt"
tap "railwaycat/emacsmacport"
tap "scalacenter/bloop"
tap "shopify/shopify"
brew "antigen"
brew "automake"
brew "snappy"
brew "base64"
brew "openssl@1.1"
brew "sqlite"
brew "python@3.9", link: false
brew "python@3.8"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "dep"
brew "docker"
brew "fd"
brew "libtool"
brew "pkg-config"
brew "ffmpeg"
brew "gcc"
brew "gdk-pixbuf"
brew "gifski"
brew "git"
brew "gnuplot"
brew "graphviz"
brew "ispell"
brew "jq"
brew "kafkacat"
brew "krb5"
brew "kubernetes-cli"
brew "libev"
brew "libnotify"
brew "libvterm"
brew "libxml2"
brew "libyaml"
brew "mas"
brew "maven"
brew "md5sha1sum"
brew "mysql", link: false
brew "mysql-client"
brew "mysql-client@5.7", link: true
brew "pandoc"
brew "parquet-tools"
brew "poppler"
brew "postgresql"
brew "pyenv"
brew "recode"
brew "ripgrep"
brew "ruby-install"
brew "sbt"
brew "scala@2.11", link: true
brew "shadowenv"
brew "shellcheck"
brew "the_silver_searcher"
brew "tldr"
brew "wget"
brew "wordnet"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zlib"
brew "coursier/formulas/coursier"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-spacemacs-icon"]
brew "scalacenter/bloop/bloop"
brew "shopify/shopify/ejson"
brew "shopify/shopify/libcidr-shopify"
brew "shopify/shopify/nginx-shopify"
brew "shopify/shopify/oauth-tunnel-client"
brew "shopify/shopify/presto-jdbc"
cask "adoptopenjdk8"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-slab"
cask "google-cloud-sdk"
cask "graphiql"
cask "xquartz"
